In [56]:
import pandas as pd

# I. Types

## I.1. DataFrames

#### A 2D table, similar to a spreadsheet (with column names and row labels)

In [134]:
pd.DataFrame({'Age':[24, 19, 50, 61], 
              'Height':[182, 173, 170, 179], 
              'Weight':[79, 70, 85, 90]},
               index = ['Rayen', 'Emna', 'Hasna', 'Kais'])

       Age  Height  Weight
Rayen   24     182      79
Emna    19     173      70
Hasna   50     170      85
Kais    61     179      90

### Reading files

In [59]:
students = pd.read_csv('./student_scores.csv', index_col = 0)
students

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17
...,...,...,...,...,...,...,...,...,...,...,...
Student_24996,IDL,20,20,1,11,14,14,20.0,6.0,14.0,13.33
Student_24997,IDL,13,6,10,1,0,6,9.5,5.5,3.0,6.00
Student_24998,ISEOC,13,15,12,15,15,4,14.0,13.5,9.5,12.33
Student_24999,ISEOC,14,10,12,7,17,20,12.0,9.5,18.5,13.33
Student_25000,IDISC,10,4,19,18,5,12,7.0,18.5,8.5,11.33

## I.2. Series

##### A 1D array, similar to a column in a spreadsheet (with a column name and row labels).

In [13]:
pd.Series(range(0,10),
          index = ['Num '+str(i) for i in range(0,10)],
          name ='Numbers from 1 to 10')

Num 0    0
Num 1    1
Num 2    2
Num 3    3
Num 4    4
Num 5    5
Num 6    6
Num 7    7
Num 8    8
Num 9    9
Name: Numbers from 1 to 10, dtype: int64

# II. DataFrame Methods

In [14]:
students.shape

(25000, 11)

In [61]:
students.head(5)

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17

In [62]:
students.tail(5)

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_24996,IDL,20,20,1,11,14,14,20.0,6.0,14.0,13.33
Student_24997,IDL,13,6,10,1,0,6,9.5,5.5,3.0,6.00
Student_24998,ISEOC,13,15,12,15,15,4,14.0,13.5,9.5,12.33
Student_24999,ISEOC,14,10,12,7,17,20,12.0,9.5,18.5,13.33
Student_25000,IDISC,10,4,19,18,5,12,7.0,18.5,8.5,11.33

In [63]:
students.index

Index(['Student_1', 'Student_2', 'Student_3', 'Student_4', 'Student_5',
       'Student_6', 'Student_7', 'Student_8', 'Student_9', 'Student_10',
       ...
       'Student_24991', 'Student_24992', 'Student_24993', 'Student_24994',
       'Student_24995', 'Student_24996', 'Student_24997', 'Student_24998',
       'Student_24999', 'Student_25000'],
      dtype='object', name='Student', length=25000)

In [107]:
students.columns

Index(['Class', 'Math_1', 'Math_2', 'Physics_1', 'Physics_2', 'Science_1',
       'Science_2', 'Math', 'Physics', 'Science', 'Score'],
      dtype='object')

#### This is useful if you can come up with an index for the dataset which is better than the current one.

In [64]:
students.set_index('Math')

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Physics,Science,Score
Math,,,,,,,,,,
10.0,IDL,6,14,15,3,14,0,9.0,7.0,8.67
8.0,ISEOC,1,15,13,3,5,5,8.0,5.0,7.00
10.5,IDL,13,8,9,7,15,12,8.0,13.5,10.67
15.0,IDL,13,17,4,13,18,6,8.5,12.0,11.83
12.0,IDISC,9,15,1,8,4,0,4.5,2.0,6.17
...,...,...,...,...,...,...,...,...,...,...
20.0,IDL,20,20,1,11,14,14,6.0,14.0,13.33
9.5,IDL,13,6,10,1,0,6,5.5,3.0,6.00
14.0,ISEOC,13,15,12,15,15,4,13.5,9.5,12.33
12.0,ISEOC,14,10,12,7,17,20,9.5,18.5,13.33
7.0,IDISC,10,4,19,18,5,12,18.5,8.5,11.33

# III. Selecting

## III.1. Selecting Series from DataFrames

In [65]:
students.Math.head(5)

Student
Student_1    10.0
Student_2     8.0
Student_3    10.5
Student_4    15.0
Student_5    12.0
Name: Math, dtype: float64

In [66]:
students['Science'].tail(5)

Student
Student_24996    14.0
Student_24997     3.0
Student_24998     9.5
Student_24999    18.5
Student_25000     8.5
Name: Science, dtype: float64

In [69]:
students.Physics[10]

/tmp/ipykernel_15539/2030041136.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  students.Physics[10]

3.0

In [22]:
students['Score'][952]

/tmp/ipykernel_15539/3448463596.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  students['Score'][952]

8.83

## III.2. Index based selection

#### Selecting data based on its numerical position in the dataframe with the iloc method.
#### The first paramater is the row range and the second parameter is the column range.
#### These parameters could be passed as Start:End operators or as a list containing indexes.

In [75]:
# Select the 10th row of a DataFrame 
students.iloc[10]

Class         IDL
Math_1          5
Math_2          3
Physics_1       3
Physics_2       3
Science_1      13
Science_2      20
Math          4.0
Physics       3.0
Science      16.5
Score        7.83
Name: Student_11, dtype: object

In [76]:
# Select all the rows of the Math column
students.Math.iloc[:]

Student
Student_1        10.0
Student_2         8.0
Student_3        10.5
Student_4        15.0
Student_5        12.0
                 ...
Student_24996    20.0
Student_24997     9.5
Student_24998    14.0
Student_24999    12.0
Student_25000     7.0
Name: Math, Length: 25000, dtype: float64

In [77]:
students.iloc[350:356, [7, 8, 9, 10]] #Same as students.iloc[[350,..,356], [7, 8, 9, 10]]

             Math  Physics  Science  Score
Student
Student_351  11.5     10.0      7.5   9.67
Student_352   7.5     12.0     18.5  12.67
Student_353   7.0     10.0      9.5   8.83
Student_354   8.5     10.5     14.5  11.17
Student_355   3.5     10.5     14.5   9.50
Student_356   9.5     14.0     10.0  11.17

## III.3. Label based selection

#### Similar to Index based selection with iloc but the second parameter used in loc is a list of column names instead of column indexes.

In [78]:
students.loc[:, ['Math', 'Physics', 'Science']]

               Math  Physics  Science
Student
Student_1      10.0      9.0      7.0
Student_2       8.0      8.0      5.0
Student_3      10.5      8.0     13.5
Student_4      15.0      8.5     12.0
Student_5      12.0      4.5      2.0
...             ...      ...      ...
Student_24996  20.0      6.0     14.0
Student_24997   9.5      5.5      3.0
Student_24998  14.0     13.5      9.5
Student_24999  12.0      9.5     18.5
Student_25000   7.0     18.5      8.5

[25000 rows x 3 columns]

## III.4. Conditional selection

In [79]:
students.iloc[0:5]['Score'] > 8

Student
Student_1     True
Student_2    False
Student_3     True
Student_4     True
Student_5    False
Name: Score, dtype: bool

In [89]:
students.loc[(students.Math > 9) &
             (students.Physics == 13) &
             (students.Science.notnull()) & #isnull
             (students.Physics_1.isin(list(range(0,10))))
            ].head(5)

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_53,IDISC,9,18,9,17,4,4,13.5,13.0,4.0,10.17
Student_157,ISEOC,17,9,6,20,3,20,13.0,13.0,11.5,12.50
Student_333,IDL,18,17,9,17,10,6,17.5,13.0,8.0,12.83
Student_539,ISEOC,18,5,7,19,7,15,11.5,13.0,11.0,11.83
Student_934,IDL,16,20,8,18,20,2,18.0,13.0,11.0,14.00

# IV. Assigning Data

In [29]:
# students.Math = students.Math.mean()

# V. Summary Functions

#### All of these functions can be used on Dataframes or Series alike.

In [90]:
# High-level summary of the attributes of the given column# 
# Different output for strings ( output aware )
students.describe()

,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
count,25000.000000,25000.000000,25000.000000,25000.00000,25000.00000,25000.000000,25000.000000,25000.000000,25000.000000,25000.000000
mean,9.967520,9.983720,10.017960,10.02404,9.96360,9.992000,9.975620,10.021000,9.977800,9.991499
std,6.066038,6.073013,6.036779,6.05628,6.06219,6.063864,4.294212,4.290274,4.283492,2.463287
min,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000,0.000000,0.000000,1.670000
25%,5.000000,5.000000,5.000000,5.00000,5.00000,5.000000,7.000000,7.000000,7.000000,8.330000
50%,10.000000,10.000000,10.000000,10.00000,10.00000,10.000000,10.000000,10.000000,10.000000,10.000000
75%,15.000000,15.000000,15.000000,15.00000,15.00000,15.000000,13.000000,13.000000,13.000000,11.670000
max,20.000000,20.000000,20.000000,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000,19.000000

In [91]:
students.Math.median()

10.0

In [92]:
students.Physics.mean()

10.021

In [95]:
students.Score.unique()

array([ 8.67,  7.  , 10.67, 11.83,  6.17, 11.67,  9.5 ,  7.5 ,  9.67,
        8.17,  7.83, 10.33, 13.33, 10.17,  9.83, 12.17, 12.67, 10.  ,
       14.17,  8.  , 12.5 , 11.  , 13.  ,  7.33, 11.17,  8.5 ,  3.83,
       13.5 , 12.  ,  9.33, 13.67, 14.  ,  6.33,  6.  ,  8.83,  5.  ,
       10.83, 13.17,  5.67, 11.5 , 12.83,  9.17,  8.33,  9.  , 15.33,
        4.5 ,  7.17, 15.  , 11.33, 12.33, 10.5 ,  6.5 ,  4.33,  6.67,
        3.33,  5.5 ,  4.67, 14.83, 15.17, 16.5 , 15.67,  7.67, 16.17,
        6.83, 14.5 ,  5.17,  5.83, 13.83, 15.83, 14.67,  4.17,  4.83,
       14.33,  5.33, 16.33,  3.67, 16.  , 16.67, 15.5 ,  4.  ,  3.17,
        3.5 , 17.  , 17.17,  2.67, 18.17,  3.  , 17.33,  2.33, 17.5 ,
       18.5 , 18.33, 17.83,  2.5 ,  1.67,  2.83, 18.67, 16.83, 19.  ,
       18.  , 17.67,  2.  ])

In [98]:
students.Math.value_counts().tail(5)

Math
1.0     174
0.5     119
19.5    100
20.0     62
0.0      52
Name: count, dtype: int64

## V.1. Maps

#### They return new, transformed Series and DataFrames, respectively. 
#### They don't modify the original data they're called on.

In [99]:
students.Math.map(lambda mark: mark + 2 ).tail(5)

Student
Student_24996    22.0
Student_24997    11.5
Student_24998    16.0
Student_24999    14.0
Student_25000     9.0
Name: Math, dtype: float64

#### The equivalent method if we want to transform a whole DataFrame by calling a custom method on each row.

In [36]:
def plus_deux(mark):
    return mark
students.apply(plus_deux, axis = 'columns')

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17
...,...,...,...,...,...,...,...,...,...,...,...
Student_24996,IDL,20,20,1,11,14,14,20.0,6.0,14.0,13.33
Student_24997,IDL,13,6,10,1,0,6,9.5,5.5,3.0,6.00
Student_24998,ISEOC,13,15,12,15,15,4,14.0,13.5,9.5,12.33
Student_24999,ISEOC,14,10,12,7,17,20,12.0,9.5,18.5,13.33
Student_25000,IDISC,10,4,19,18,5,12,7.0,18.5,8.5,11.33

## V.2. Combining Series into one

In [37]:
(students.Math + 2 + students.Score > 20).head()

Student
Student_1     True
Student_2    False
Student_3     True
Student_4     True
Student_5     True
dtype: bool

## V.3. More Functions

In [103]:
students.Score.idxmax()

'Student_15693'

In [101]:
students.Score.idxmin()

'Student_10029'

In [106]:
students.loc[ students.Math == students.Math.max() ].head(5)

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_533,IDL,20,20,12,17,8,8,20.0,14.5,8.0,14.17
Student_1197,ISEOC,20,20,5,18,19,18,20.0,11.5,18.5,16.67
Student_1972,IDL,20,20,14,1,19,2,20.0,7.5,10.5,12.67
Student_2668,IDISC,20,20,14,17,17,4,20.0,15.5,10.5,15.33
Student_3397,IDL,20,20,10,19,13,5,20.0,14.5,9.0,14.50

In [41]:
students.Science.max()

20.0

In [42]:
students.Physics.abs()

Student
Student_1         9.0
Student_2         8.0
Student_3         8.0
Student_4         8.5
Student_5         4.5
                 ...
Student_24996     6.0
Student_24997     5.5
Student_24998    13.5
Student_24999     9.5
Student_25000    18.5
Name: Physics, Length: 25000, dtype: float64

# VI. Grouping and Sorting

## VI.1.  Groupwise analysis

In [112]:
students.groupby('Class').Score.count()

Class
IDISC    8384
IDL      8167
ISEOC    8449
Name: Score, dtype: int64

In [113]:
students.Score.value_counts().head(5)

Score
9.67     685
10.17    676
10.00    675
9.33     675
10.50    671
Name: count, dtype: int64

In [114]:
students.groupby('Class').Math.max()

Class
IDISC    20.0
IDL      20.0
ISEOC    20.0
Name: Math, dtype: float64

In [118]:
# We can also group by multiple columns
students.groupby(['Class', 'Math']).Physics.min()

Class  Math
IDISC  0.0     1.5
       0.5     2.0
       1.0     4.0
       1.5     1.0
       2.0     1.5
              ...
ISEOC  18.0    1.5
       18.5    1.0
       19.0    0.0
       19.5    1.5
       20.0    1.0
Name: Physics, Length: 123, dtype: float64

In [122]:
# Run a bunch of different functions on your DataFrame simultaneously.
students.groupby('Class').Score.agg([len, max, min])

/tmp/ipykernel_15539/71011373.py:2: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  students.groupby('Class').Score.agg([len, max, min])
/tmp/ipykernel_15539/71011373.py:2: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  students.groupby('Class').Score.agg([len, max, min])

        len    max   min
Class
IDISC  8384  18.67  1.67
IDL    8167  18.67  2.00
ISEOC  8449  19.00  2.50

## VI.2. Multi-indexes

#### A multi-index differs from a regular index in that it has multiple levels.
#### pandas.core.indexes.multi.MultiIndex

#### Multi-indices have several methods for dealing with their tiered structure which are absent for single-level indices. They also require two levels of labels to retrieve a value.

## VI.3. Sorting

In [124]:
students.sort_values(by = 'Score', ascending = True).head()

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_10029,IDISC,0,0,3,3,3,1,0.0,3.0,2.0,1.67
Student_20536,IDL,5,4,0,1,0,2,4.5,0.5,1.0,2.00
Student_4606,IDISC,4,1,4,0,3,2,2.5,2.0,2.5,2.33
Student_19547,IDL,3,9,1,0,2,0,6.0,0.5,1.0,2.50
Student_21392,IDISC,1,0,2,4,7,1,0.5,3.0,4.0,2.50

In [125]:
students.sort_index().head() #Sort by the index values

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_10,IDL,7,5,17,12,0,8,6.0,14.5,4.0,8.17
Student_100,IDL,11,9,10,10,4,20,10.0,10.0,12.0,10.67
Student_1000,ISEOC,11,18,12,6,7,4,14.5,9.0,5.5,9.67
Student_10000,IDISC,2,14,1,12,3,6,8.0,6.5,4.5,6.33

In [128]:
# Sort by more than one column 
students.sort_values(by=['Score', 'Math'], ascending = False)

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_15693,ISEOC,20,16,20,20,19,19,18.0,20.0,19.0,19.00
Student_16668,IDL,20,18,19,20,20,15,19.0,19.5,17.5,18.67
Student_11980,IDISC,16,20,18,19,19,20,18.0,18.5,19.5,18.67
Student_6274,IDISC,20,19,19,14,20,19,19.5,16.5,19.5,18.50
Student_9737,IDISC,16,20,18,20,18,18,18.0,19.0,18.0,18.33
...,...,...,...,...,...,...,...,...,...,...,...
Student_21392,IDISC,1,0,2,4,7,1,0.5,3.0,4.0,2.50
Student_9557,ISEOC,0,0,0,8,6,1,0.0,4.0,3.5,2.50
Student_4606,IDISC,4,1,4,0,3,2,2.5,2.0,2.5,2.33
Student_20536,IDL,5,4,0,1,0,2,4.5,0.5,1.0,2.00
Student_10029,IDISC,0,0,3,3,3,1,0.0,3.0,2.0,1.67

#  VII. Data Types

#### The data type for a column in a DataFrame or a Series is known as the dtype.

In [129]:
students.Math.dtype

dtype('float64')

#### Alternatively, the dtypes property returns the dtype of every column in the DataFrame

In [131]:
students.dtypes.head()

Class        object
Math_1        int64
Math_2        int64
Physics_1     int64
Physics_2     int64
dtype: object

In [54]:
students.index.dtype

dtype('O')

## VII.1. Converting types

In [136]:
# This returns a new Serires
students.Math_1.astype('float64').head()

Student
Student_1     6.0
Student_2     1.0
Student_3    13.0
Student_4    13.0
Student_5     9.0
Name: Math_1, dtype: float64

# VIII. Missing Data

#### Entries missing values are given the value NaN, short for "Not a Number". For technical reasons these NaN values are always of the float64 dtype.

In [137]:
# To select NaN entires use this
students[pd.isnull(students.Math)]

Empty DataFrame
Columns: [Class, Math_1, Math_2, Physics_1, Physics_2, Science_1, Science_2, Math, Physics, Science, Score]
Index: []

In [139]:
students[pd.notnull(students.Math)].head()

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17

## VIII.1. Replacing missing Data

In [140]:
# Replace each NaN with an "Unknown"
# Or we could fill each missing value with the first non-null value that appears sometime after the given record in the database. T
# This is the backfill strategy.
students.Math.fillna('Unknown')

Student
Student_1        10.0
Student_2         8.0
Student_3        10.5
Student_4        15.0
Student_5        12.0
                 ...
Student_24996    20.0
Student_24997     9.5
Student_24998    14.0
Student_24999    12.0
Student_25000     7.0
Name: Math, Length: 25000, dtype: float64

## VIII.2. Replacing normal data

In [149]:
students.Math.replace(10, 20).head()

Student
Student_1    20.0
Student_2     8.0
Student_3    10.5
Student_4    15.0
Student_5    12.0
Name: Math, dtype: float64

# IX. Renaming and Combining

## IX.1. Renaming

#### Rename index or column values by specifying a index or column keyword parameter, respectively, using a python dictionnary with the old and new values

In [151]:
# Change index names and/or column names.
# New dataframe
students.rename(columns={'Math': '7seb', 'Physics': 'Chimie'}).head()

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,7seb,Chimie,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17

In [159]:
students.rename(index={2: 'Rayen'}).head() # Only works if the index_col is default

,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Student,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17

#### Both the row index and the column index can have their own name attribute. The complimentary rename_axis() method may be used to change these names.

In [158]:
students.rename_axis("Etudiants",axis='rows').rename_axis("Matieres", axis='columns').head()

Matieres,Class,Math_1,Math_2,Physics_1,Physics_2,Science_1,Science_2,Math,Physics,Science,Score
Etudiants,,,,,,,,,,,
Student_1,IDL,6,14,15,3,14,0,10.0,9.0,7.0,8.67
Student_2,ISEOC,1,15,13,3,5,5,8.0,8.0,5.0,7.00
Student_3,IDL,13,8,9,7,15,12,10.5,8.0,13.5,10.67
Student_4,IDL,13,17,4,13,18,6,15.0,8.5,12.0,11.83
Student_5,IDISC,9,15,1,8,4,0,12.0,4.5,2.0,6.17

# IX.2. Combining

#### Combine different DataFrames and/or Series in non-trivial ways.
#### concat(), join(), and merge() (In order of complexity)

#### Given a list of elements, this function will smush those elements together along an axis. This is useful when we have data in different DataFrame or Series objects but having the same fields (columns).

In [ ]:
#pd.concat([dataf1, dataf2]) # or Series

#### join 
####  lets you combine different DataFrame objects which have an index in common